""" Ваня и Петя поспорили, кто быстрее решит следующую задачу: 
"Задана последовательность неотрицательных целых чисел.
Требуется определить значение наибольшего элемента последовательности,
которая завершается первым втретившимся нулем (число 0 не входит в последовательность)"
Однако 2 друга оказались на такими смышленными. Никто из ребят не смог до конца сделать это задание.
Они решели так: у кого будет меньше ошибок в коде, тот и выиграл спор.
За помощью товарищи обратились к Вам, студентам.

Примечение: программные коды на следующих слайдах """

""" n = 1
max_number = 0
while n != 0:
    n = int(input())
    if max_number < n:
        max_number = n
print(max_number) """


""" n = 1
max_number = 0
while n > 0:
    n = int(input())
    if max_number < n:
        max_number = n
print(max_number) """